app/Http/Controllers/BlogController.php

select * from `categories` order by `title` asc
---
    public function getAllCategories()
    {
        /** @var array $categories */
        $categories = Category::with(['posts' => function($query){
            $query->published();
        }])->orderBy('title', 'asc')
            ->get();

update `posts` set `view_count` = 12, `posts`.`updated_at` = '2020-04-01 07:05:10' where `id` = 7
---
    public function viewCount($post)
    {
        $viewCount = $post->view_count + 1;
        $post->update(['view_count' => $viewCount]);