app/Http/Controllers/BlogController.php

select * from `categories` order by `title` asc
---
    public function category($id)
    {
        $categories = Category::with(['posts' => function($query){
            $query->published();
        }])
            ->orderBy('title', 'asc')
            ->get();

        $posts = Post::with('author')
            ->latestFirst()
            ->published()
            ->where('category_id', $id)
            ->simplePaginate($this->limit);
        return view('blog.index')->with(compact('posts','categories'));